#pragma once

#include "BlackBox/BigEndian.hpp"
#include <array>
#include <cstdint>

namespace MPU6050Regs {

enum registerAddresses {
    GyroscopeXOffsetTC = 0x00, /*!< See the dev_t structure for more info */
    GyroscopeYOffsetTC, /*!< No idea... */
    GyroscopeZOffsetTC, /*!< No idea... */
    FineGainX, /*!< No idea... */
    FineGainY, /*!< No idea... */
    FineGainZ, /*!< No idea... */
    AccelerometerXOffsetH, /*!< There is some weird stuff going on here, read the docs before you write setters! */
    AccelerometerXOffsetL,
    AccelerometerYOffsetH,
    AccelerometerYOffsetL,
    AccelerometerZOffsetH,
    AccelerometerZOffsetL,
    ProductID,
    SelfTestX,
    SelfTestY,
    SelfTestZ,
    SelfTestA,
    Unknown0,
    Unknown1,
    GyroscopeXOffsetH,
    GyroscopeXOffsetL,
    GyroscopeYOffsetH,
    GyroscopeYOffsetL,
    GyroscopeZOffsetH,
    GyroscopeZOffsetL,
    SampleRateDivider,
    Config,
    GyroscopeConfig,
    AccelerometerConfig,
    FreeFallThreshold,
    FreeFallDuration,
    MotionThreshold,
    MotionDuration,
    ZeroMotionThreshold,
    ZeroMotionDuration,
    FIFOEnable,
    I2CMasterControl,
    I2CSlave0Address,
    I2CSlave0Register,
    I2CSlave0Control,
    I2CSlave1Address,
    I2CSlave1Register,
    I2CSlave1Control,
    I2CSlave2Address,
    I2CSlave2Register,
    I2CSlave2Control,
    I2CSlave3Address,
    I2CSlave3Register,
    I2CSlave3Control,
    I2CSlave4Address,
    I2CSlave4Register,
    I2CSlave4DataOut,

    0x13, 0x14, 0x15, 0x16, 0x17, 0x18, 0x19, 0x1A, 0x1B, 0x1C, 0x1D, 0x1E, 0x1F, 0x20, 0x23, 0x24, 0x25, 0x26, 0x27, 0x28, 0x29, 0x2A, 0x2B, 0x2C, 0x2D, 0x2E, 0x2F, 0x30, 0x31, 0x32, 0x33, 0x34, 0x35, 0x36, 0x37, 0x38, 0x39, 0x3A, 0x3B, 0x3C, 0x3D, 0x3E, 0x3F, 0x40, 0x41, 0x42, 0x43, 0x44, 0x45, 0x46, 0x47, 0x48, 0x49, 0x4A, 0x4B, 0x4C, 0x4D, 0x4E, 0x4F, 0x50, 0x51, 0x52, 0x53, 0x54, 0x55, 0x56, 0x57, 0x58, 0x59, 0x5A, 0x5B, 0x5C, 0x5D, 0x5E, 0x5F, 0x60, 0x61,
    0x63, 0x64, 0x65, 0x66, 0x67, 0x68, 0x69, 0x6A, 0x6B, 0x6C, 0x6D, 0x6E, 0x6F, 0x70, 0x71, 0x72, 0x73, 0x74, 0x75
    } };
*/

static constexpr std::array<registerAddresses, 69> writableRegisters = { {
    GyroscopeXOffsetTC,
    GyroscopeYOffsetTC,
    GyroscopeZOffsetTC,
    FineGainX,
    FineGainY,
    FineGainZ,
    AccelerometerXOffsetH,
    AccelerometerXOffsetL,
    AccelerometerYOffsetH,
    AccelerometerYOffsetL,
    AccelerometerZOffsetH,
    AccelerometerZOffsetL,
    SelfTestX,
    SelfTestY,
    SelfTestZ,
    SelfTestA,
    GyroscopeXOffsetH,
    GyroscopeXOffsetL,
    GyroscopeYOffsetH,
    GyroscopeYOffsetL,
    GyroscopeZOffsetH,
    GyroscopeZOffsetL,
    SampleRateDivider,
    Config,
    GyroscopeConfig,
    AccelerometerConfig,
    FreeFallThreshold,
    FreeFallDuration,
    MotionThreshold,
    MotionDuration,
    ZeroMotionThreshold,
    ZeroMotionDuration,
    FIFOEnable,
    I2CMasterControl,
    I2CSlave0Address,
    I2CSlave0Register,
    I2CSlave0Control,
    I2CSlave1Address,
    I2CSlave1Register,
    I2CSlave1Control,
    I2CSlave2Address,
    I2CSlave2Register,
    I2CSlave2Control,
    I2CSlave3Address,
    I2CSlave3Register,
    I2CSlave3Control,
    I2CSlave4Address,
    I2CSlave4Register,
    I2CSlave4DataOut,
    I2CSlave4Control,
    I2CSlave4DataIn,
    I2CSlave0DataOut,
    I2CSlave1DataOut,
    I2CSlave2DataOut,
    I2CSlave3DataOut,
    I2CMasterDelayControl,
    SignalPathReset,
    MotionDetectionControl,
    UserControl,
    PowerManagement1,
    PowerManagement2,
    BankSelection,
    MemoryStartAddress,
    MemoryReadWrite,
    ProgramStartAddressH,
    ProgramStartAddressL,
    FIFOCountH,
    FIFOCountL,
    FIFOReadWrite,
} };

enum ExternalSyncSettings : std::uint8_t {
    InputDisabled = 0,
    TemperatureOutL0,
    GyroscopeXOutL0,
    GyroscopeYOutL0,
    GyroscopeZOutL0,
    AccelerometerXOutL0,
    AccelerometerYOutL0,
    AccelerometerZOutL0,
};

enum AccelerometerFullScaleSelect : std::uint8_t {
    _2G = 0,
    _4G,
    _8G,
    _16G,
};

enum GyroscopeFullScaleSelect : std::uint8_t {
    _250DpS = 0,
    _500DpS,
    _1000DpS,
    _2000DpS,
};

enum I2CMasterClockSpeed {
    _348kHz = 0,
    _333kHz,
    _320kHz,
    _308kHz,
    _296kHz,
    _286kHz,
    _276kHz,
    _267kHz,
    _258kHz,
    _500kHz,
    _471kHz,
    _444kHz,
    _421kHz,
    _400kHz,
    _381kHz,
    _364kHz,
};

enum WakeUpFrequency : std::uint16_t {
    _1Hz25 = 0,
    _5Hz,
    _20Hz,
    _40Hz,
};

enum ClockSelection : std::uint16_t {
    Internal = 0,
    PLLGyroX,
    PLLGyroY,
    PLLGyroZ,
    PLL32k768Hz,
    PLL19M2Hz,
    Reserved,
    Stop,
};

#pragma pack(push, 1)

union MPU6050_dev_t {
    struct {
        union {
            struct {
                union {
                    struct {
                        std::uint8_t otpBnkVld : 1;
                        std::uint8_t value : 6;
                        std::uint8_t auxilaryI2CVDD : 1; /*!< configures the high logic level of the auxiliary I2C bus to be either VLOGIC or VDD. When set to 1, the auxiliary I2C bus high logic level is VDD. When cleared to 0, the auxiliary I2C bus high logic level is VLOGIC. */
                    };
                    std::uint8_t reg; // 0x00
                } x;

                union {
                    struct {
                        std::uint8_t reserved : 1;
                        std::uint8_t value : 6;
                        std::uint8_t reserved1 : 1;
                    };
                    std::uint8_t reg; // 0x01
                } y;

                union {
                    struct {
                        std::uint8_t reserved : 1;
                        std::uint8_t value : 6;
                        std::uint8_t reserved1 : 1;
                    };
                    std::uint8_t reg; // 0x02
                } z;
            };
            std::uint8_t regs[3];
        } gyroscopeOffsetTC;

        union {
            struct {
                std::uint8_t x; // 0x03
                std::uint8_t y; // 0x04
                std::uint8_t z; // 0x05
            };
            std::uint8_t regs[3];
        } fineGain;

        union {
            struct {
                BE::Int16 x; // 0x06
                BE::Int16 y; // 0x08
                BE::Int16 z; // 0x0A
            };
            BE::Int16 values[3];
            std::uint8_t regs[6];
        } accelerometerOffset;

        std::uint8_t ProductID; // 0x0C

        union {
            struct {
                std::uint8_t gyroTest : 5;
                std::uint8_t accelerometerTest : 3;
            };
            std::uint8_t reg;
        } selfTestX; // 0x0D

        union {
            struct {
                std::uint8_t gyroTest : 5;
                std::uint8_t accelerometerTest : 3;
            };
            std::uint8_t reg;
        } selfTestY; // 0x0E

        union {
            struct {
                std::uint8_t gyroTest : 5;
                std::uint8_t accelerometerTest : 3;
            };
            std::uint8_t reg;
        } selfTestZ; // 0x0F

        union {
            struct {
                std::uint8_t zTest : 2;
                std::uint8_t yTest : 2;
                std::uint8_t xTest : 2;
                std::uint8_t reserved : 2;
            };
            std::uint8_t reg;
        } selfTestA; // 0x10

        std::uint8_t unknown0; // 0x11
        std::uint8_t unknown1; // 0x12

        union {
            struct {
                BE::Int16 x; // 0x13
                BE::Int16 y; // 0x15
                BE::Int16 z; // 0x17
            };
            BE::Int16 values[3];
            std::uint8_t regs[6];
        } gyroscopeOffset; 

        std::uint8_t sampleRateDivider; // 0x19

        union {
            struct {
                std::uint8_t digitalLowPassFilter : 3;
                ExternalSyncSettings externalSyncSet : 3;
                std::uint8_t reserved : 2;
            };
            std::uint8_t reg; // 0x1A
        } config;

        union {
            struct {
                std::uint8_t reserved : 3;
                GyroscopeFullScaleSelect fullScaleSelect : 2;
                std::uint8_t doSelfTestZ : 1;
                std::uint8_t doSelfTestY : 1;
                std::uint8_t doSelfTestX : 1;
            };
            std::uint8_t reg;
        } gyroscopeConfig; // 0x1B

        union {
            struct {
                std::uint8_t reserved : 3;
                AccelerometerFullScaleSelect fullScaleSelect : 2;
                std::uint8_t doSelfTestZ : 1;
                std::uint8_t doSelfTestY : 1;
                std::uint8_t doSelfTestX : 1;
            };
            std::uint8_t reg;
        } accelerometerConfig; // 0x1C

        std::uint8_t freeFallThreshold; // 0x1D
        std::uint8_t freeFallDuration; // 0x1E

        std::uint8_t motionThreshold; // 0x1F
        std::uint8_t motionDuration; // 0x20

        std::uint8_t zeroMotionThreshold; // 0x21
        std::uint8_t zeroMotionDuration; // 0x22

        union {
            struct {
                std::uint8_t slave0 : 1;
                std::uint8_t slave1 : 1;
                std::uint8_t slave2 : 1;
                std::uint8_t accelerometer : 1;
                std::uint8_t gyroscopeZ : 1;
                std::uint8_t gyroscopeY : 1;
                std::uint8_t gyroscopeX : 1;
                std::uint8_t temperature : 1;
            };
            std::uint8_t reg;
        } fifoEnable; // 0x23

        union {
            struct {
                I2CMasterClockSpeed clock : 4;
                std::uint8_t noRestart : 1;
                std::uint8_t slave3FIFOEnable : 1;
                std::uint8_t waitForExternalSensor : 1;
                std::uint8_t multiMasterEnable : 1;
            };
            std::uint8_t reg;
        } i2cMasterControl; // 0x24

        union {
            struct {
                struct {
                    std::uint8_t address : 7;
                    std::uint8_t readWrite : 1;
                };
                std::uint8_t registerAddress;
                struct {
                    std::uint8_t length : 4;
                    std::uint8_t groupingOrder : 1;
                    std::uint8_t writeRegisterAddress : 1;
                    std::uint8_t byteSwap : 1;
                    std::uint8_t enable : 1;
                };
            };
            std::uint8_t regs[3];
        } slaveControl[4];

        union {
            struct {
                struct {
                    std::uint8_t address : 7;
                    std::uint8_t readWrite : 1;
                }; // 0x31
                std::uint8_t registerAddress; // 0x32
                std::uint8_t dataToBeWritten; // 0x33
                struct {
                    std::uint8_t length : 5;
                    std::uint8_t writeRegisterAddress : 1;
                    std::uint8_t enableInterrupt : 1;
                    std::uint8_t enable : 1;
                }; // 0x34
                std::uint8_t dataRead; // 0x35
            };
            std::uint8_t regs[5];
        } slaveControl4;

        union {
            struct {
                std::uint8_t slave0NACK : 1;
                std::uint8_t slave1NACK : 1;
                std::uint8_t slave2NACK : 1;
                std::uint8_t slave3NACK : 1;
                std::uint8_t slave4NACK : 1;
                std::uint8_t lostArbitration : 1;
                std::uint8_t slave4Done : 1;
                std::uint8_t passThrough : 1;
            };
            std::uint8_t reg;
        } masterStatus; // 0x36

        union {
            struct {
                std::uint8_t reserved : 1;
                std::uint8_t i2cBypassEnable : 1;
                std::uint8_t fsyncInterruptEnable : 1;
                std::uint8_t fsyncInterruptLevel : 1;
                std::uint8_t clearOnReadMode : 1;
                std::uint8_t latchInterrupt : 1;
                std::uint8_t openDrainEnable : 1;
                std::uint8_t activeLevel : 1;
            };
            std::uint8_t reg;
        } interruptPinConfig; // 0x37

        union {
            struct {
                std::uint8_t dataReady : 1;
                std::uint8_t reserved : 2;
                std::uint8_t masterI2CInterrupt : 1;
                std::uint8_t fifoOverflow : 1;
                std::uint8_t reserved1 : 3;
            };
            std::uint8_t reg;
        } interruptEnable; // 0x38

        union {
            struct {
                std::uint16_t dmp0 : 1; // 0x39
                std::uint16_t dmp1 : 1;
                std::uint16_t dmp2 : 1;
                std::uint16_t dmp3 : 1;
                std::uint16_t dmp4 : 1;
                std::uint16_t dmp5 : 1;
                std::uint16_t reserved : 2;
                std::uint16_t dataReady : 1; // 0x3A
                std::uint16_t dmpInitialized : 1;
                std::uint16_t pllReady : 1;
                std::uint16_t masterI2CInterrupt : 1;
                std::uint16_t fifoOverflow : 1;
                std::uint16_t zeroMotion : 1;
                std::uint16_t motion : 1;
                std::uint16_t freeFall : 1;
            };
            std::uint8_t regs[2];
        } interruptStatus;

        union {
            struct {
                union {
                    struct {
                        BE::Int16 x; // 0x3B
                        BE::Int16 y; // 0x3D
                        BE::Int16 z; // 0x3F
                    };
                    BE::Int16 values[3];
                    std::uint8_t regs[6];
                } accelerometer;

                BE::Uint16 temperature; // 0x41

                union {
                    struct {
                        BE::Int16 x; // 0x43
                        BE::Int16 y; // 0x45
                        BE::Int16 z; // 0x47
                    };
                    BE::Int16 values[3];
                    std::uint8_t regs[6];
                } gyroscope;
            };
            BE::Int16 values[7];
            std::uint8_t regs[14];
        } measurements;

        std::uint8_t externalSensorData[24]; // 0x49

        union {
            struct {
                std::uint8_t zeroMotion : 1;
                std::uint8_t reserved : 1;
                std::uint8_t zPositive : 1;
                std::uint8_t zNegative : 1;
                std::uint8_t yPositive : 1;
                std::uint8_t yNegative : 1;
                std::uint8_t xPositive : 1;
                std::uint8_t xNegative : 1;
            };
            std::uint8_t reg;
        } motionDetectionStatus; // 0x61

        std::uint8_t unknown2; // 0x62

        std::uint8_t slaveDataOut[4]; // 0x63

        union {
            struct {
                std::uint8_t slave0DelayEnable : 1;
                std::uint8_t slave1DelayEnable : 1;
                std::uint8_t slave2DelayEnable : 1;
                std::uint8_t slave3DelayEnable : 1;
                std::uint8_t slave4DelayEnable : 1;
                std::uint8_t reserved : 2;
                std::uint8_t externalSensorShadowEnable : 1;
            };
            std::uint8_t reg;
        } i2cMasterDelayControl; // 0x67

        union {
            struct {
                std::uint8_t temperatureReset : 1;
                std::uint8_t accelerometerReset : 1;
                std::uint8_t gyroscopeReset : 1;
                std::uint8_t reset : 5;
            };
            std::uint8_t reg;
        } signalPathReset; // 0x68

        union {
            struct {
                std::uint8_t motionCount : 2;
                std::uint8_t freeFallCount : 2;
                std::uint8_t accelerometerOnDelay : 2;
                std::uint8_t reserved : 2;
            };
            std::uint8_t reg;
        } motionDetectionControl; // 0x69

        union {
            struct {
                std::uint8_t signalCondReset : 1;
                std::uint8_t i2cMasterReset : 1;
                std::uint8_t fifoReset : 1;
                std::uint8_t reserved : 1;
                std::uint8_t i2cInterfaceDisable : 1; /*!< On MPU-6050 always write 0 */
                std::uint8_t i2cMasterEnable : 1;
                std::uint8_t fifoEnable : 1;
                std::uint8_t reserved1 : 1;
            };
            std::uint8_t reg;
        } userControl; // 0x6A

        union {
            std::uint8_t regs[2];
            struct {
                ClockSelection clockSelection : 3; // 0x6B
                std::uint16_t temperatureDisable : 1;
                std::uint16_t reserved : 1;
                std::uint16_t cycle : 1;
                std::uint16_t sleep : 1;
                std::uint16_t deviceReset : 1;
                std::uint16_t standbyZGyroscope : 1; // 0x6C
                std::uint16_t standbyYGyroscope : 1;
                std::uint16_t standbyXGyroscope : 1;
                std::uint16_t standbyZAccelerometer : 1;
                std::uint16_t standbyYAccelerometer : 1;
                std::uint16_t standbyXAccelerometer : 1;
                WakeUpFrequency LowPowerWakeControl : 1;
            };
        } powerManagement;

        union {
            struct {
                std::uint8_t memorySelect : 5;
                std::uint8_t configureUserBank : 1;
                std::uint8_t prftchEnable : 1; // FIXME: WTF? prefetch?
                std::uint8_t reserved : 1;
            };
            std::uint8_t reg;
        } bankSelection; // 0x6D

        std::uint8_t memoryStartAddress; // 0x6E
        std::uint8_t memoryReadWrite; // 0x6F

        BE::Uint16 programStartAddress; // 0x70

        BE::Uint16 fifoCount; // 0x72

        std::uint8_t fifoReadWrite; // 0x74

        union {
            std::uint8_t reg;
            struct {
                std::uint8_t reserved : 1;
                std::uint8_t data : 6;
                std::uint8_t reserved1 : 1;
            };
        } whoAmI; // 0x75
    };
    std::uint8_t regs[MaxAddress];

    constexpr MPU6050_dev_t() : powerManagement{0x40, 0}, whoAmI{0x68} {}
};

#pragma pack(pop)

static constexpr unsigned dmpProgramSize = 3062;

static constexpr std::array<std::uint8_t, dmpProgramSize> dmpProgram = {
    /* bank # 0 */
    0x00, 0x00, 0x70, 0x00, 0x00, 0x00, 0x00, 0x24, 0x00, 0x00, 0x00, 0x02, 0x00, 0x03, 0x00, 0x00,
    0x00, 0x65, 0x00, 0x54, 0xff, 0xef, 0x00, 0x00, 0xfa, 0x80, 0x00, 0x0b, 0x12, 0x82, 0x00, 0x01,
    0x03, 0x0c, 0x30, 0xc3, 0x0e, 0x8c, 0x8c, 0xe9, 0x14, 0xd5, 0x40, 0x02, 0x13, 0x71, 0x0f, 0x8e,
    0x38, 0x83, 0xf8, 0x83, 0x30, 0x00, 0xf8, 0x83, 0x25, 0x8e, 0xf8, 0x83, 0x30, 0x00, 0xf8, 0x83,
